import axios from 'axios';

const handler = async (m, { conn, args }) => {

  if (!args[0]) return conn.reply(m.chat, '🍟 Por favor, proporciona un término.', m, rcanal);
  
  await m.react('🕓');

  const emojis = [
    '😊', '🔥', '💥', '😍', '🤩', '🎉', '😘', '🤗', '😆', '😂',
    '🎊', '🔴', '💖', '❤️', '💕', '🥳', '🤯', '💯', '😎', '😌',
    '😏', '🤔', '🥺', '😮', '🤪', '😅', '😇', '🤭', '🤫', '🙃',
    '😏', '🤑', '💀', '👻', '👾', '🤖', '👺', '👹', '🦸', '🦸‍♀️',
    '🦸‍♂️', '🌈', '🌟', '⚡', '💫', '🌧️', '🔥', '🔥', '🌸', '🌼',
    '🌻', '🌷', '🍀', '🍁', '🍂', '🍃', '🍉', '🍓', '🍒', '🍑',
    '🥭', '🍍', '🥤', '🍦', '🍰', '🎂', '🍭', '🍬', '🍫', '🍿',
    '🎈', '🎀', '🎁', '📦', '🏆', '🥇', '🥈', '🥉', '🎊', '📣',
    '🎶', '🎵', '🎤', '🎧', '🎹', '⚽', '🏀', '🏈', '🎣', '🎮',
    '🧩', '🧸', '🍭', '🎨', '✈️', '🚗', '🚀', '🛥️', '🏍️', '🛴',
    '🛶', '⛴️', '🚁', '🚢', '🚊', '🚉', '🚏', '🚥', '🚦', '🗺️',
    '🗿', '🎭', '🖼️', '🏰', '🏯', '🌅', '🌄', '🏞️', '🌌', '🌠',
    '🔔', '🔊', '🔉', '🔈', '🛎️', '🏴‍☠️', '🎌', '🎇', '✨', '🌌',
    '🌈', '🥳', '👨‍🍳', '👩‍🍳', '👨‍🎤', '👩‍🎤', '👨‍🎨', '👩‍🎨', '🎖️', '🕊️',
    '🤝', '👐', '🤲', '✋', '👋', '☝️', '👆', '👇', '👉', '👈',
    '🤙', '🖐️', '🤚', '✋', '🦶', '🦵', '🦿', '🧘‍♂️', '🧘‍♀️', '👣',
    '👥', '👤', '👫', '👬', '👭', '🤝', '🧑‍🤝‍🧑', '💏', '💑', '👨‍❤️‍👨',
    '👩‍❤️‍👩', '🧑‍🤝‍🧑'
  ];

  const delay = ms => new Promise(res => setTimeout(res, ms));

  try {
    for (const emoji of emojis) {
      await m.react(emoji); 
      await delay(200); 
    }
    
    await conn.reply(m.chat, '¡Reaccioné con 200 emojis!', m);
  } catch (error) {
    console.error(error);
    await m.react('✖️'); 
  }
};

handler.command = ['reaccionar', 'reacc']; 

export default handler;